cfe llm/InformationRegisters/AI_ОчередьЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AI_Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вложение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_СтатусОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_СтатусОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_СтатусОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ОчередьЗапросов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗафиксироватьОшибкуОбработки(Идентификатор, ТекстОшибки) Экспорт

	МаксПопыток = Константы.AI_КоличествоПопытокОбработкиЗапросаОчереди.Получить();
	Если МаксПопыток = 0 Тогда
		МаксПопыток = 5;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.AI_ОчередьЗапросов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УникальныйИдентификатор = Идентификатор;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Ошибка = ТекстОшибки;
	МенеджерЗаписи.КоличествоОшибок = МенеджерЗаписи.КоличествоОшибок + 1;
	МенеджерЗаписи.ДатаНачалаОбработки = '00010101000000';

	Если МенеджерЗаписи.КоличествоОшибок >= МаксПопыток Тогда
		МенеджерЗаписи.Статус = Перечисления.AI_СтатусОчереди.Ошибка;
	Иначе
		МенеджерЗаписи.Статус = Перечисления.AI_СтатусОчереди.Новый;
	КонецЕсли;

	МенеджерЗаписи.Записать(Истина);

КонецПроцедуры

// Возвращает запись в очередь без инкремента счётчика ошибок.
// Используется при получении 429 (лимит запросов провайдера) —
// это временная перегрузка API, а не ошибка самого запроса.
Процедура ВернутьВОчередьБезОшибки(Идентификатор) Экспорт
	МенеджерЗаписи = РегистрыСведений.AI_ОчередьЗапросов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УникальныйИдентификатор = Идентификатор;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Статус = Перечисления.AI_СтатусОчереди.Новый;
	МенеджерЗаписи.ДатаНачалаОбработки = '00010101000000';
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

Процедура УдалитьЗапросИзОчереди(Идентификатор) Экспорт
	НаборЗаписей = РегистрыСведений.AI_ОчередьЗапросов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(Идентификатор);
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

Процедура ПоставитьЗапросВОчередь(Провайдер, ТипAPI, Модель, AI_Агент, Промт, ИмяВложения = "", Вложение = Неопределено) Экспорт

	МенеджерЗаписи = РегистрыСведений.AI_ОчередьЗапросов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Провайдер = Провайдер;
	МенеджерЗаписи.ТипAPI = ТипAPI;
	МенеджерЗаписи.Модель = Модель;
	МенеджерЗаписи.AI_Агент = AI_Агент;
	МенеджерЗаписи.Промт = Промт;
	МенеджерЗаписи.ИмяВложения = ИмяВложения;
	МенеджерЗаписи.Статус = Перечисления.AI_СтатусОчереди.Новый;

	Если НЕ Вложение = Неопределено Тогда
		МенеджерЗаписи.Вложение = Новый ХранилищеЗначения(Вложение);
	КонецЕсли;

	МенеджерЗаписи.Записать(Истина);

КонецПроцедуры

// Атомарно переводит запись из "Новый" в "ВОбработке".
// Возвращает Истина — запись захвачена, Ложь — уже занята другим потоком или не существует.
Функция ЗафиксироватьНачалоОбработки(Идентификатор) Экспорт

	Результат = Ложь;

	НаборЗаписей = РегистрыСведений.AI_ОчередьЗапросов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(Идентификатор);

	НачатьТранзакцию();
	Попытка
		НаборЗаписей.Заблокировать();
		НаборЗаписей.Прочитать();

		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
			Если Запись.Статус = Перечисления.AI_СтатусОчереди.Новый Тогда
				Запись.Статус = Перечисления.AI_СтатусОчереди.ВОбработке;
				Запись.ДатаНачалаОбработки = ТекущаяДатаСеанса();
				НаборЗаписей.Записать(Истина);
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			"AI_ОчередьЗапросов",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			СтрШаблон("Ошибка захвата записи очереди [%1]: %2",
				Идентификатор, ОписаниеОшибки()));
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти
